{
    "Donald Trump delivered the largest tax cuts in American history.": [
        {
            "page_content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\nLargest Tax Cut in History? - FactCheck.org\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFacebook\n\n\n\nTwitter\n\n\n\nTumblr\n\n\n\nClose\n\n\n\n\n\n\n\n\n\n\n\nSkip to main content\n\n\n\n\n\n\n\n\n\n\n\n            FactCheck.org®\n\n\nA Project of The Annenberg Public Policy Center\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n              FactCheck.org®\n\n\n\nHome\nArticles\n\nFeatured Posts\nFactCheck Posts\nSciCheck\nEn Español\n2024 elections\nPlayers Guide 2024\nDebunking Viral Claims\n\n\nAsk a Question\n\nAsk FactCheck\nAsk SciCheck\n\n\nDonate\nTopics\n\nPresident Biden\nDonald Trump\nKamala Harris\nJD Vance\nTim Walz\nhealth\nCoronavirus\nimmigration\nclimate change\nView All\n\n\nAbout Us\n\nOur Mission\nOur Process\nOur Funding\nOur Staff\nUndergraduate Fellows\nAwards\nRequest a Correction\nContact Us\n\n\nSearch\nMore\n\nViral Claims\nSubscribe\nInstagram\nThreads\nYouTube\nX (Twitter)\nFacebook\nTikTok\nFactCheck On the Air\nMailbag\n\n\n \n\n\n\n\n\nFactCheck Posts\nLargest Tax Cut in History?\n\n By Lori RobertsonPosted on November 1, 2017 | Updated on December 6, 2017\n\n\n\n\n\n\n\n\n\n\n2.2KWill the Republican tax plan be the “largest tax cut in history,” as the Trump administration has repeatedly said? That’s still unknown. But past tax cuts have been larger than cost estimates of the GOP plan.\nPresident Donald Trump and others in the administration have been making the “largest tax cut” claim for months. We wrote about a Trump-for-president campaign committee TV ad that made the claim in May. The president made the boast again on Sept. 27, the day the White House and GOP leaders released the framework of their tax plan, and, among many other examples, he repeated it on Twitter on Oct. 18, saying: “Hopefully, all Senate Republicans will vote for the largest Tax Cuts in U.S. history.” White House Press Secretary Sarah Sanders tweeted the talking point 10 days later.\nBut so far, the White House hasn’t supported that claim and did not respond to our request for information.\nThe tax plan is only a framework, with many details yet to be filled in. It would reduce the corporate tax rate from 35 percent to 20 percent; abolish the alternative minimum tax; collapse the seven income tax brackets, which range from 10 percent to 39.6 percent, to three (12 percent, 25 percent and 35 percent); increase the standard deduction but eliminate exemptions; eliminate most itemized deductions except for mortgage interest and charitable giving; increase the child tax credit; and abolish the estate tax.\nThe Committee for a Responsible Federal Budget said it “very roughly” estimated a $2.2 trillion cost over 10 years. (That’s similar to the Tax Policy Center’s estimate of a $2.4 trillion cost over 10 years.)\n“That would make this tax cut the 8th largest as a percent of Gross Domestic Product (GDP) since 1918 and the 4th largest in inflation-adjusted dollars,” CRFB wrote in an Oct. 25 blog post.\nCRFB used a Treasury Department analysis that we also have referred to in the past. The 2013 report, by tax analyst Jerry Tempalski, detailed the revenue effects of major tax legislation. (Tempalski prepared such a report in 2006, and updated the tax tables in 2011, too.)\nThe latest report shows that the “largest tax cut in history” designation would go to either President Ronald Reagan’s 1981 tax cut or President Barack Obama’s 2012 extension of most of the George W. Bush-era income tax cuts, depending on how the size of the tax cut is measured.\nAs we’ve written before, the best measurement is the revenue effect as a percentage of gross domestic product. Tempalski wrote in 2006 that this measure “eliminates the effects of inflation, real economic growth, and the size of total federal receipts.” Over a four-year average, the revenue effect of Reagan’s 1981 tax cut was 2.89 percent of GDP. (Reagan’s cut also had the largest impact as a percentage of federal receipts over a four-year average.) That’s the most of any tax cut in the Treasury report, going back to 1940.\nUsing CRFB’s cost estimate for the current Republican tax plan, the average revenue effect would be 0.9 percent of GDP over the 10-year period. That’s also lower than tax cuts implemented in 2010 and 2013, as well as those in 1948, 1945 and 1964, with the last three measured over just one year. (The Treasury report includes the four-year averages for tax measures since 1978, but uses shorter periods for prior years.)\nThe CRFB analysis relies on a 2012 paper by University of California, Berkeley economists to look at pre-1940 tax cuts. That puts one more tax measure, in 1921, above the latest GOP proposal in terms of percentage of GDP.\nThe GOP plan would have to be doubled or tripled in order to surpass the 1981 tax cut, CRFB said. “If President Trump wanted to pass a tax cut that exceeds the record 2.9 percent of the economy in 1981, it would cost roughly $6.8 trillion over ten years.”\nWe could also look at tax cuts in terms of inflation-adjusted dollars. By that measure, the American Taxpayer Relief Act of 2012 (implemented in 2013) tops the list, costing $320.6 billion in 2012 dollars over a four-year average. The GOP tax plan would come in at $190 billion on an annual average in 2012 dollars, CRFB found. That would be the fourth largest tax cut — also behind tax reductions in 2010 ($210 billion) and 1981 ($208 billion).\nUsing inflation-adjusted dollars “tends to have a bias towards recent tax cuts since the tax base usually grows faster than inflation,” CRFB says, noting that percentage of GDP is the “better way to compare costs over long time periods.”\nAs we said, the GOP tax framework is still missing some details. The final tax bill hasn’t yet been written, although it may be released as early as Nov. 2. But the Trump administration’s claim of the “largest” tax cut in history remains unsupported, and disputed by budget experts.\nThe plan may be limited to a cost of $1.5 trillion over 10 years, if lawmakers adhere to a Senate budget resolution that allowed for such an increase to the deficit to pay for the tax cuts. That would move the tax plan further down the list of the largest tax cuts in history.\nUpdate, Dec. 6: The final legislation, released and passed by the House and Senate, would still not be the largest tax cut in history: The GOP plan still comes in eighth or fourth place, as measured by a percentage of gross domestic product or in inflation-adjusted dollars, respectively.\nThe House legislation as released was estimated by the nonpartisan Joint Committee on Taxation to cost $1.49 trillion over 10 years. Over the first four years, the average annual cost would be $185 billion or about 1 percent of GDP. And an amended House bill was about the same — $1.44 trillion over 10 years, and an average $190 billion over the first four years. The final Senate bill would cost $1.45 trillion over 10 years, or $179 billion over the first four years on average, the JCT said.\n\nShare the Facts\n2017-11-01 15:39:26 UTC\n\n\nFactCheck.org\n\n\n\n1\n1\n11\n FactCheck.org Rating:\nUnsupported\n\nThe Republican tax plan will be the largest tax cut in U.S. history.\n\n\n\nDonald Trump\nPresident of the United States\nhttps://www.whitehouse.gov/administration/president-trump\n\n\nTwitter\nWednesday, October 18, 2017\n2017-10-18\n\n\n\nRead More\ninfo\n\n\n\n\n\n\nCategories FactCheck Posts\n\nLocation National\n\nIssue tax cuts\n\nTaxes\n\nPeople Donald Trump\n\n\n\n\n\n\n\nPrevious StoryWas Papadopoulos a ‘Low-Level Volunteer’?Next StorySchumer and the Diversity Visa Lottery \n\n\n\n\n\n\nAsk SciCheck\nQ: Are wind farms harmful to the environment?\nA: Like all energy sources, wind farms have some negative environmental impacts. But getting energy from wind farms results in dramatically lower greenhouse gas emissions than getting it from fossil fuels.\nRead the full question and answer View the Ask SciCheck archivesHave a question? Ask us.\n\n\nDonate Now\nBecause facts matter.\n\n\n \n \n\n\n\n\n\nSciCheck's COVID-19/Vaccination Project\nPreempting and exposing vaccination and COVID-19 misinformation.\n\n\n\n\n \n\n\n\n\n\nProyecto de Vacunación/COVID-19\nPrecaviendo y exponiendo la desinformación sobre el COVID-19 y sus vacunas\n\n\n\n\n \n\n\n\n\n\nSciCheck\nFact-checking science-based claims.\n\n\n\n\n \n\n\n\n\n\nFacebook Initiative\nDebunking viral claims.\n\n\n\n\n \n\n\n\n\n\nPlayers Guide 2024\nThe special interest groups behind the TV ads.\n\n\n\n\n \n\n\n\n\n\nViral Spiral\nDon’t get spun by internet rumors.\n\n\n\n\n \n\n\n\n\n\nSign Up\nGet free email alerts.\n\n\n\n\n \n\n\n\n\n\nMailbag\nLetters from our readers.\n\n\n\n\n \n\n\n\n\n\nOn the Air\nOur staff on TV and radio.\n\n\n\n\n \n\n\n\n\n\nNewsFeed Defenders\nA media literacy game to detect misinformation.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nArchives\nPrivacy\nCopyright Policy\nContact Us\nReport Accessibility Issues and Get Help\n \n© Copyright 2025 FactCheck.org ®A Project of The Annenberg Public Policy Center of the University of Pennsylvania\n\n\n\n\n\n\n\n\n\n\n\n",
            "metadata": {
                "source": "https://www.factcheck.org/2017/11/largest-tax-cut-history/"
            }
        },
        {
            "page_content": "President Trump’s tax cut: Not ‘the biggest’ in U.S. history - The Washington Post\nAccessibility statementSkip to main contentDemocracy Dies in DarknessclockThis article was published more than 7 years agoDemocracy Dies in DarknessFact CheckerAboutArchiveFact CheckerAboutArchivePresident Trump’s tax cut: Not ‘the biggest’ in U.S. historyNovember 1, 2017The president has a habit of exaggerating; this time his exaggeration is the size of his proposed tax cut. (Video: Meg Kelly/The Washington Post)Analysis by  Glenn Kessler“This now allows for the passage of large scale Tax Cuts (and Reform), which will be the biggest in the history of our country!”— President Trump, in a tweet, Oct. 20, 2017More than 20 times since he became president, President Trump has claimed that the tax plan under consideration in Congress was the largest tax cut in the history of the United States. He made this claim even before many details were set, but from the beginning it was nonsense. It was so easily debunked that we just tossed it in our ongoing database of false and misleading Trump claims, rather than do a full-fledged fact check.On occasion, the White House has suggested Trump is talking only about the corporate-tax component of the tax plan. But that’s never how the president himself frames it. So we have to examine his claim as he states it.AdvertisementNow that the House and Senate have approved the parameters of the tax cut –$1.5 trillion over 10 years — we have numbers we can evaluate. So, for the record, here’s how his plan stacks up — assuming it actually gets passed into law.The FactsThe best way to compare tax cuts (or spending plans) over time is to measure them as a percentage of the national economy. Inflation-adjusted dollars are another option, but a percentage of gross domestic product helps put the impact of the bill into context.The Treasury Department has regularly compared tax cuts and increases using both methods, most recently in 2013. The Treasury analysis goes back to 1940, using either the first year of the tax legislation for tax bills between 1940 and 1968 or a four-year average of the bills between 1968 and 2012.The budget blueprint approved by Republicans indicates that tax cut would reduce revenue by $167 billion in 2018; it also averages out to $167 billion a year in the first four years. We’ll use a gross domestic product of $19.5 trillion in 2018, which assumes the kind of growth Trump expects.AdvertisementThat means the tax cut would be nearly 0.9 percent of GDP.Compare that to:Economic Recovery Act of 1981 (Reagan): 2.89 percentRevenue Act of 1945 (Truman): 2.67 percentRevenue Act of 1948 (Truman): 1.87 percentAmerican Taxpayer Relief Act of 2012 (Obama): 1.78 percentRevenue Act of 1964 (Johnson): 1.6 percentTax Relief and Job Creation Act of 2010 (Obama): 1.31 percentIn other words, Trump’s tax cut would even be smaller than two tax cuts passed by Congress under President Barack Obama. We’re sure that must be a source of irritation. In fact, Trump’s tax cut would even fall behind Obama’s tax cuts when measured by inflation-adjusted dollars, according to the Committee for a Responsible Federal Budget.Here’s a useful chart put together by CRFB, which labels the Trump tax cut as “Framework.” The group also included an estimate for a 1921 tax cut from a 2012 paper by Christina Romer and David Romer.The Pinocchio TestWe realize that the president often likes to say biggest or best, but his claim about the tax plan is embarrassing flimflam. He needs to drop this talking point. Saying it over and over does not make it so.Four Pinocchios(About our rating scale)AdvertisementSend us facts to check by filling out this formKeep tabs on Trump’s promises with our Trump Promise TrackerSign up for The Fact Checker weekly newsletter Share the Facts 2017-11-01 12:57:12 UTC   Washington Post  1 1 5 Washington Post Rating: Four Pinocchios  “This now allows for the passage of large scale Tax Cuts (and Reform), which will be the biggest in the history of our country!”    Donald Trump President www.whitehouse.gov in a tweet Friday, October 20, 2017 2017-10-20    Read More  info    Sign upCompanyAbout The Post Newsroom Policies & Standards Diversity & Inclusion Careers Media & Community Relations WP Creative Group Accessibility Statement SectionsTrending Politics Elections Opinions National World Style Sports Business Climate Well+Being D.C., Md., & Va. Obituaries Weather Arts & Entertainments Recipes Get The PostManage Your Subscription Become a Subscriber Gift Subscriptions Mobile & Apps Newsletters & Alerts Washington Post Live Reprints & Permissions Post Store Books & E-Books Print Special Editions Store Print Archives (Subscribers Only) Today’s Paper Public Notices Contact UsContact the Newsroom Contact Customer Care Contact the Opinions Team Advertise Licensing & Syndication Request a Correction Send a News Tip Report a Vulnerability Terms of UseDigital Products Terms of Sale Print Products Terms of Sale Terms of Service Privacy Policy Cookie Settings Submissions & Discussion Policy RSS Terms of Service Sitemap Ad Choices Your Privacy Choices washingtonpost.com  © 1996-2025 The Washington PostCompanyChevron IconDiversity & Inclusion Careers Media & Community Relations WP Creative Group Accessibility Statement SectionsChevron IconTrending Politics Elections Opinions National World Style Sports Business Climate Well+Being D.C., Md., & Va. Obituaries Weather Arts & Entertainments Recipes Get The PostChevron IconManage Your Subscription Become a Subscriber Gift Subscriptions Mobile & Apps Newsletters & Alerts Washington Post Live Reprints & Permissions Post Store Books & E-Books Print Special Editions Store Print Archives (Subscribers Only) Today’s Paper Public Notices Contact UsChevron IconContact the Newsroom Contact Customer Care Contact the Opinions Team Advertise Licensing & Syndication Request a Correction Send a News Tip Report a Vulnerability Download the Washington Post App About The Post Policies & Standards Digital Products Terms of Sale Print Products Terms of Sale Terms of Service Privacy Policy Cookie Settings Submissions & Discussion Policy RSS Terms of Service Sitemap Ad Choices Your Privacy Choices washingtonpost.com © 1996-2025 The Washington Post\n\n",
            "metadata": {
                "source": "https://www.washingtonpost.com/news/fact-checker/wp/2017/11/01/president-trumps-tax-cut-not-the-biggest-in-u-s-history/"
            }
        },
        {
            "page_content": "\n\n\n\n\n\n\nPolitiFact | Fact-checking Trump’s claims about tax cuts, job numbers and inflation in Wisconsin, Michigan\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                  The Poynter Institute\n                \n\n\n\n\n\n\n\nMenu\n\n\n\n\n            Donate\n          \n\n\n\n\n\n\n\n\n\n\n                    State Editions\n                  \n\n\n\n\n                          California\n                        \n\n\n\n                          Florida\n                        \n\n\n\n                          Iowa\n                        \n\n\n\n                          Michigan\n                        \n\n\n\n                          New Hampshire\n                        \n\n\n\n                          New York\n                        \n\n\n\n                          North Carolina\n                        \n\n\n\n                          Pennsylvania\n                        \n\n\n\n                          Texas\n                        \n\n\n\n                          West Virginia\n                        \n\n\n\n                          Wisconsin\n                        \n\n\n\n\n\n\n\n\n\n\n                    Issues\n                  \n\n\n\nAll Issues\n\n\n\n                          Online hoaxes\n                        \n\n\n\n                          Coronavirus\n                        \n\n\n\n                          Health Care\n                        \n\n\n\n                          Immigration\n                        \n\n\n\n                          Extremism\n                        \n\n\n\n                          Taxes\n                        \n\n\n\n                          Marijuana\n                        \n\n\n\n                          Environment\n                        \n\n\n\n                          Crime\n                        \n\n\n\n                          Guns\n                        \n\n\n\n                          Foreign Policy\n                        \n\n\n\n                          LGBTQ+\n                        \n\n\n\n\n\n\n\n\n\n                    People\n                  \n\n\n\n\n                          Joe Biden\n                        \n\n\n\n                          Kamala Harris\n                        \n\n\n\n                          Donald Trump\n                        \n\n\n\n                          Mitch McConnell\n                        \n\n\n\n                          Hakeem Jeffries\n                        \n\n\n\n                          Ron DeSantis\n                        \n\n\n\n\n\n\n\n\n\n                    Media\n                  \n\n\n\n\n                          PunditFact\n                        \n\n\n\n                          Tucker Carlson\n                        \n\n\n\n                          Sean Hannity\n                        \n\n\n\n                          Rachel Maddow\n                        \n\n\n\n                          Bloggers\n                        \n\n\n\n                          PolitiFact Videos\n                        \n\n\n\n\n\n\n\n                    Campaigns\n                  \n\n\n\n\n                          2024 Elections\n                        \n\n\n\n\n\n\n\n\n\n                    Truth-o-Meter\n                  \n\n\n\n\n                          True\n                        \n\n\n\n                          Mostly True\n                        \n\n\n\n                          Half True\n                        \n\n\n\n                          Mostly False\n                        \n\n\n\n                          False\n                        \n\n\n\n                          Pants on Fire\n                        \n\n\n\n\n\n\n\n                    Promises\n                  \n\n\n\n\n                          Biden Promise Tracker\n                        \n\n\n\n                          Trump-O-Meter\n                        \n\n\n\n                          Obameter\n                        \n\n\n                          Latest Promises\n                        \n\n\n\n\n\n\n\n\n\n\n                    About Us\n                  \n\n\n\n\n                          Our Process\n                        \n\n\n\n                          Our Staff\n                        \n\n\n\n                          En Español\n                        \n\n\n\n                          Who pays for PolitiFact?\n                        \n\n\n\n                          Advertise with Us\n                        \n\n\n\n                          Suggest a Fact-check\n                        \n\n\n\n                          Corrections and Updates\n                        \n\n\n\n                          Newsletters\n                        \n\n\n\n\n\n\n\n\n\n\n\n              Donate\n            \n\n\n\n\n                Follow us\n              \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                The Facts Newsletter\n              \n\n\n\n\n\n\n                Sign up\n              \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEnglish\n\nEspañol\n\n\n\n\n\n\n\n\n\n\n\n\n          Stand up for the facts!\n        \n\n        Our only agenda is to publish the truth so you can be an informed participant in democracy.\n        We need your help.\n        \n\nMore Info\n\n\n\n\n\n\n          I would like to contribute\n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOne Time\nMonthly\nYearly\n\n\n\n\n\n\n            Join Now\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n              Fact-checking Trump’s claims about tax cuts, job numbers and inflation in Wisconsin, Michigan\n            \n\n\n\n\nEconomy\n\n\n\n\nWisconsin\n\n\n\n\nMichigan\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n        Former President Donald Trump arrives at a campaign rally in Waukesha, Wis., on May 1, 2024. (AP)\n        \n      \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n    \n    By Louis Jacobson\nMay 2, 2024\n\n\n\n\n\n\n\n    \n    By Amy Sherman\nMay 2, 2024\n\n\n\n\n\n\nFormer President Donald Trump at May 1 rallies in Wisconsin and Michigan — battleground states with high numbers of manufacturing jobs — highlighted his vision for the economy.\nTrump made misleading statements about tax cuts and jobs filled by immigrants in the U.S. illegally, but spoke more accurately on the rising costs of food, including chicken.\nThronged by thousands of his supporters, Trump told jokes and attacked President Joe Biden’s demeanor and record on jobs and the economy. Trump’s appearance was a marked departure from the Manhattan courtroom, where he has been required to sit silently for hourslong stretches during the first of up to four criminal trials. \n\"When I’m in the White House, the Biden economic bust will quickly be replaced with the Trump economic boom,\" Trump said in Waukesha, Wisconsin.\nHere are our fact-checks of his statements on the economy, which voters often tell pollsters is their top concern.\n\n\n\nSign up for PolitiFact texts\n\n\n\n\n\n\n\"The people that benefited the most (from the tax cuts Trump signed) are lower-income people,\" and Biden \"wants them to expire.\"  \nThe first part of this statement is wrong; the second is misleading.\nThe part about low-income taxpayers benefiting more \"is not correct,\" based on modeling from the Urban Institute-Brookings Institution Tax Policy Center and other think tanks, said John Buhl, the Tax Policy Center’s communications director.\nThe Tax Policy Center analysis found that the Trump-signed legislation would, on average, cut taxes for households in each income group, but that taxpayers in higher-income households would see the biggest benefits.\nFor instance, the lowest one-fifth of taxpayers — people earning up to $25,000 — would see their average federal tax rate drop by 0.4 percentage points in 2018. The drop in tax rate would be larger for each successive one-fifth of the income spectrum, with the top one-fifth seeing its tax rates drop by 1.8 percentage points. The biggest gains would go to households in the top 1% to 5% of incomes (from $307,900 to $732,000); their tax rates would drop by 3.1 percentage points. \nThe numbers were similar for changes through 2025, the Tax Policy Center found.\nOn whether Biden wants to get rid of the tax cuts, Trump appeared to refer to brief remarks Biden made about the Trump tax cuts in April, when he said, \"It’s going to expire. And if I’m reelected, it’s going to stay expired.\"\nHowever, Biden has said repeatedly that he will not raise taxes on anyone making less than $400,000, a promise he campaigned on in 2020. The White House told PolitiFact that Biden would let the Trump tax cuts expire for wealthier taxpayers but would not let Americans making less than $400,000 see any tax increase. \n\"A lot of the numbers … that just came out on immigration and unemployment (showed that) all of the numbers were from illegal immigrants.\"\nThere are significant problems with this statement. \nThe employment of foreign-born workers is relatively small — in 2023, foreign-born workers accounted for just less than 20% of all workers — but the count has been growing for years, especially since the pandemic.\nThe federal government counts the data for foreign-born and native-born employment using a survey of households. From month to month, the data tends to whipsaw because the survey has a sizable margin of error.\nLooking at just the most recent month-to-month changes, as Trump said he was doing, the increase in native-born employment (929,000) from February 2024 to March 2024 was more than eight times larger than the increase in foreign-born employment (112,000) over the same period. Those numbers contradict what Trump said.\nTo iron out the data, we previously looked at a longer period: Biden’s presidency. From February 2021 to February 2024, native-born employment rose by almost 5.7 million workers. That was a larger increase than the 5.1 million for foreign-born workers. So, the increase in foreign-born workers was substantial, and disproportionate to their share of the overall labor force, but it was not \"all,\" as Trump said.\nTrump is also off base in saying the entire increase in employment came from \"illegal immigrants.\" The statistics for the foreign-born workforce are much broader than \"illegal immigrants\" or recent migrants. They also include many people who immigrated to the U.S. legally and have been U.S. citizens for decades and people here as legal permanent residents, or green card holders.\nUnder Biden, \"chicken — I love chicken — is up 24%. Baby food is up 30%. Eggs are up 59%. Gasoline is up 50%. … Airfares are up 33%\"\nTrump is pretty close with most of the price increases he cited.\n\n\nThe price for boneless chicken breasts rose by 26% from Biden’s January 2021 inauguration to March 2024. \n\n\nThe price for canned baby foods (a category that includes some other specialty foods) rose by 30% over the same period. \n\n\nA dozen Grade A large eggs more than doubled in price.\n\n\nGasoline prices rose by 53%.\n\n\nDuring the same period, wages rose by almost 16%, so the costs of each of these items rose faster than wages.\nThe most misleading of Trump’s price statistics is airline fares. Airline fares are 27% higher now than they were when Biden took office. But Biden became president when the pandemic had dampened demand for interstate travel, so the January 2021 prices were artificially low by historical standards.\nAirfares are cheap by historical standards. The current price level for airline tickets is almost identical to where it was during Trump’s tenure, and it’s mostly lower than it was for most of Barack Obama’s presidency. Having airfares lower than they were in the early-to-mid 2010s means that prices have eased rather than risen.\n\"And I already gave you the largest tax cut in the history of our country, larger than the Reagan tax cuts many years ago. You got the largest tax cuts in history.\"\nThis is a falsehood Trump shared repeatedly during his presidency. (Our colleagues at the Washington Post Fact Checker found that this was Trump’s second-most-commonly repeated false claim, shared 295 times during his presidency.)\nIn inflation-adjusted dollars, the tax bill Trump signed was the fourth-largest since 1940, and as a percentage of GDP, it ranked seventh.\n\"GDP growth was plunging by more than 50% in the first quarter of this year.\"\nTrump is right on the numbers. However, to the layperson, his framing might make this drop sound more alarming than it is.\nIn 2023’s fourth quarter, gross domestic product rose by 3.4% on an annualized basis. In 2024’s first quarter, it rose by 1.6%. \nBut GDP itself did not plunge by 50%; that would have represented a massive economic calamity. GDP continued to grow, but half as fast as it did in the previous quarter. Also, it had further to fall in 2024’s first quarter: The 3.4% growth in the previous quarter represented the second-fastest-growing quarter since the start of 2022.\nThe U.S. is experiencing \"record kinds of inflation.\"\nAlthough inflation is still considered an economic problem for the U.S., the overall rate is nowhere near a record.\nThe highest inflation rates were recorded in the 1970s and early 1980s, when the annual price increase sometimes hovered between 12% and 15%. The highest rate on Biden’s watch was around 9% in summer 2022. That was the highest monthly figure in about four decades, but not the highest ever.\nInflation was 3.5% in March 2024, the most recent month available. The Federal Reserve believes that’s still too high to start lowering interest rates — the Fed wants to see sustained inflation rates closer to 2% — but the current level is still about two-thirds lower than its 2022 peak.\n\"By 2030 (Biden) wants everyone to have an electric vehicle.\" \nThis is an exaggeration.\nThe Biden administration set a goal — not a mandate — to have electric vehicles comprise half of all new vehicle sales by 2030. It’s currently at about 8%.\nIn March, the administration finalized a rule that projects 30% to 56% of new light-duty vehicles will be battery-electric by 2032. That means that consumers could still buy some gasoline-powered cars, both new and used, by 2032, or hybrids.\n\"There is no federal requirement that any particular percentage of an automaker's fleet needs to be electric,\" Jeremy Michalek, director of the Carnegie Mellon Vehicle Electrification Group, said. \"Our recent work suggests that consumers haven't really changed what they value, but as EV technology gets better, with lower cost and larger range, those same consumers choose EVs more often.\"\nAutoForecast Solutions LLC, a car industry trend forecaster, projects sales of new battery-electric vehicles in the United States will be about 31% by 2031. \nThere are several challenges to expanding the EV market including the cost to purchase a car, the range the cars can go, the relative lack of charging stations compared with gas stations and the costs of raw materials for building the cars, said Joseph McCabe, president and chief executive officer of AutoForecast Solutions.\nRELATED: All of our fact-checks of Donald Trump\nRELATED: All of our fact-checks of Joe Biden and Kamala Harris\n\n\n\n\n\n\n\n        Sign Up For Our Weekly Newsletter\n      \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOur Sources\n\n\nC-SPAN, Former President Trump Holds Rally in Freeland, Michigan, May 1, 2024\nC-SPAN, Former President Trump Holds Rally in Waukesha, Wisconsin, May 1, 2014\nU.S. Environmental Protection Agency, Biden-Harris Administration finalizes strongest-ever pollution standards for cars that position U.S. companies and workers to lead the clean vehicle future, protect public health, address the climate crisis, save drivers money, March 20, 2024\nWhite House, FACT SHEET: President Biden Is Fighting to Reduce the Deficit, Cut Taxes for Working Families, and Invest in America by Making Big Corporations and the Wealthy Pay Their Fair Share, March 7, 2024\nWhite House, Remarks by President Biden at the IBEW Construction and Maintenance Conference, April 19, 2024\nCox Automotive, A Record 1.2 Million EVs Were Sold in the U.S. in 2023, According to Estimates from Kelley Blue Book, Jan. 9, 2024\nPolitiFact, Donald Trump wrong again that recent tax bill is biggest ever, Jan. 31, 2018\nTelephone interview with Joseph McCabe, President & CEO, AutoForecast Solutions LLC, May 2, 2024\nEmail interview with Michael Kikukawa, White House spokesperson, May 2, 2024\nEmail interview with Jeremy J. Michalek, director, vehicle electrification group, Carnegie Mellon University, May 2, 2024\nEmail interview with John Buhl, communications director for the Urban Institute-Brookings Institution Tax Policy Center, May 2, 2024\nEmail interview with Larisa Manescu, spokesperson for the Sierra Club, May 2, 2024\nOther sources linked in article\n\n\n\n\n\n\n\n\n\n\n\n          Browse the Truth-O-Meter\n        \n\n          \n          More by Louis Jacobson\n          \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                      Sara Jacobs\n                    \n\n                      stated on December 18, 2024 in an X post:\n                    \n\n\n\n\n\n\n\n                          \n                          Government shutdowns in 2013 and 2018 “cost our economy billions of dollars each.”\n                          \n                        \n\n\n\n\n\n\n\n\n\n\n\n                      By Louis Jacobson • December 19, 2024\n                    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                      Mike Johnson\n                    \n\n                      stated on December 5, 2024 in remarks to reporters:\n                    \n\n\n\n\n\n\n\n                          \n                          About 1% of federal employees are “actually working in the office.”\n                          \n                        \n\n\n\n\n\n\n\n\n\n\n\n                      By Louis Jacobson • December 11, 2024\n                    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                      Joe Biden\n                    \n\n                      stated on December 1, 2024 in a statement:\n                    \n\n\n\n\n\n\n\n                          \n                          On pardoning his son Hunter Biden\n                          \n                        \n\n\n\n\n\n\n\n\n\n\n\n                      By Louis Jacobson • December 2, 2024\n                    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                      Bernie Sanders\n                    \n\n                      stated on November 10, 2024 in an interview on CNN's \"State of the Union\":\n                    \n\n\n\n\n\n\n\n                          \n                          Inflation-adjusted weekly wages “are lower today than they were 50 years ago.”\n                          \n                        \n\n\n\n\n\n\n\n\n\n\n\n                      By Louis Jacobson • November 11, 2024\n                    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Instagram posts\n                    \n\n                      stated on November 7, 2024 in on social media:\n                    \n\n\n\n\n\n\n\n                          \n                          “Something stinks” that Donald Trump won in several battleground states while Democrats won Senate or governor races in those states.\n                          \n                        \n\n\n\n\n\n\n\n\n\n\n\n                      By Louis Jacobson • November 8, 2024\n                    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                      Donald Trump\n                    \n\n                      stated on October 31, 2024 in a social media post:\n                    \n\n\n\n\n\n\n\n                          \n                          “I never mentioned” wanting to end the Affordable Care Act.\n                          \n                        \n\n\n\n\n\n\n\n\n\n\n\n                      By Louis Jacobson • November 2, 2024\n                    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                      Kamala Harris\n                    \n\n                      stated on October 29, 2024 in a speech in Washington, D.C.:\n                    \n\n\n\n\n\n\n\n                          \n                          Former President Donald Trump would “force states to monitor women's pregnancies.”\n                          \n                        \n\n\n\n\n\n\n\n\n\n\n\n                      By Louis Jacobson • November 1, 2024\n                    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Senate Leadership Fund\n                    \n\n                      stated on September 1, 2024 in an ad:\n                    \n\n\n\n\n\n\n\n                          \n                          Sen. Jon Tester “voted to let men compete against our girls in their sports.”\n                          \n                        \n\n\n\n\n\n\n\n\n\n\n\n                      By Louis Jacobson • October 31, 2024\n                    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                      Jon Tester\n                    \n\n                      stated on August 20, 2024 in a post on X:\n                    \n\n\n\n\n\n\n\n                          \n                          “In Montana, we cherish our public lands. But Tim Sheehy called to transfer them off, so the ultra-rich can buy them up.”\n                          \n                        \n\n\n\n\n\n\n\n\n\n\n\n                      By Louis Jacobson • October 29, 2024\n                    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Facebook posts\n                    \n\n                      stated on October 22, 2024 in on Facebook:\n                    \n\n\n\n\n\n\n\n                          \n                          “Ballots are not supposed to have fold lines or creases in the candidates name area” or it could invalidate your vote.\n                          \n                        \n\n\n\n\n\n\n\n\n\n\n\n                      By Louis Jacobson • October 26, 2024\n                    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                      Threads posts\n                    \n\n                      stated on October 21, 2024 in a Threads post:\n                    \n\n\n\n\n\n\n\n                          \n                          The Biden-Harris administration “brought over” 10 million migrants who got 9 million jobs.\n                          \n                        \n\n\n\n\n\n\n\n\n\n\n\n                      By Sofia Ahmed • October 25, 2024\n                    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                      Kamala Harris\n                    \n\n                      stated on October 23, 2024 in a CNN town hall:\n                    \n\n\n\n\n\n\n\n                          \n                          \"As of today, we have cut the flow of immigration by over half.\"\n                          \n                        \n\n\n\n\n\n\n\n\n\n\n\n                      By Louis Jacobson • October 24, 2024\n                    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                      Donald Trump\n                    \n\n                      stated on October 17, 2024 in an ad:\n                    \n\n\n\n\n\n\n\n                          \n                          Vice President Kamala Harris “wants struggling seniors to pay more Social Security taxes while she gives Medicare and Social Security to illegals.”\n                          \n                        \n\n\n\n\n\n\n\n\n\n\n\n                      By Louis Jacobson • October 23, 2024\n                    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                      Kelly Ayotte\n                    \n\n                      stated on September 25, 2024 in a debate:\n                    \n\n\n\n\n\n\n\n                          \n                          “There was a bill to basically create a ban to make sure we never become a sanctuary state, that no locality passes those regulations, and (former Manchester Mayor Joyce Craig) opposed that bill.”\n                          \n                        \n\n\n\n\n\n\n\n\n\n\n\n                      By Louis Jacobson • October 23, 2024\n                    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                      Joyce Craig\n                    \n\n                      stated on September 15, 2024 in an interview with WMUR-TV:\n                    \n\n\n\n\n\n\n\n                          \n                          Gubernatorial candidate Kelly Ayotte “has voted for national abortion bans, she has voted to defund Planned Parenthood, and she shepherded Neil Gorsuch through the Supreme Court process, and then celebrated when Roe v. Wade was overturned.”\n                          \n                        \n\n\n\n\n\n\n\n\n\n\n\n                      By Louis Jacobson • October 23, 2024\n                    \n\n\n\n\n\n\n\n\n\n\n\n\nFact-checking Trump’s claims about tax cuts, job numbers and inflation in Wisconsin, Michigan\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                    Threads posts\n                  \n\n                    stated on January 8, 2025 in a post on Threads:\n                  \n\n\n\n\n\n\n\n                        \n                        “Blue items that survive” California wildfires are “indicative of DEW's (Directed Energy Weapons).”\n                        \n                      \n\n\n\n\n\n\n\n\n\n\n\n                    By Madison Czopek • January 10, 2025\n                  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                     Facebook posts\n                  \n\n                    stated on January 8, 2025 in una publicación en Facebook:\n                  \n\n\n\n\n\n\n\n                        \n                        Imagen muestra el letrero de Hollywood en California en llamas el 8 de enero de 2025.\n                        \n                      \n\n\n\n\n\n\n\n\n\n\n\n                    By Maria Briceño • January 10, 2025\n                  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                     Facebook posts\n                  \n\n                    stated on January 9, 2025 in a Facebook post:\n                  \n\n\n\n\n\n\n\n                        \n                        Video shows a man saving a bunny during the 2025 Los Angeles fires.\n                        \n                      \n\n\n\n\n\n\n\n\n\n\n\n                    By Loreben Tuquero • January 10, 2025\n                  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                    Social Media\n                  \n\n                    stated on January 8, 2025 in social media posts:\n                  \n\n\n\n\n\n\n\n                        \n                        Image shows the Hollywood sign was on fire as of Jan. 8.\n                        \n                      \n\n\n\n\n\n\n\n\n\n\n\n                    By Loreben Tuquero • January 10, 2025\n                  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                     Viral image\n                  \n\n                    stated on January 5, 2025 in a Facebook post:\n                  \n\n\n\n\n\n\n\n                        \n                        Video shows Dr. Mehmet Oz and rapper Snoop Dogg promoting treatment for chronic lung diseases.”\n                        \n                      \n\n\n\n\n\n\n\n\n\n\n\n                    By Ciara O'Rourke • January 10, 2025\n                  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                     X posts\n                  \n\n                    stated on January 7, 2025 in an X post:\n                  \n\n\n\n\n\n\n\n                        \n                        Video shows directed energy weapons starting fires in California.\n                        \n                      \n\n\n\n\n\n\n\n\n\n\n\n                    By Ciara O'Rourke • January 10, 2025\n                  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                     Viral image\n                  \n\n                    stated on January 6, 2025 in a Facebook post:\n                  \n\n\n\n\n\n\n\n                        \n                        McQueen High School in Nevada issued a “masturbation notice” to students.\n                        \n                      \n\n\n\n\n\n\n\n\n\n\n\n                    By Ciara O'Rourke • January 10, 2025\n                  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                     Viral image\n                  \n\n                    stated on January 1, 2025 in a Facebook post:\n                  \n\n\n\n\n\n\n\n                        \n                        Actor Tom Hanks died in a “fatal car accident.”\n                        \n                      \n\n\n\n\n\n\n\n\n\n\n\n                    By Ciara O'Rourke • January 10, 2025\n                  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                     X posts\n                  \n\n                    stated on January 8, 2025 in a post:\n                  \n\n\n\n\n\n\n\n                        \n                        “FEMA spent billions on illegal immigrants and now has no money for California!”\n                        \n                      \n\n\n\n\n\n\n\n\n\n\n\n                    By Kwasi Gyamfi Asiedu • January 10, 2025\n                  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                    Threads posts\n                  \n\n                    stated on January 7, 2025 in A Threads post:\n                  \n\n\n\n\n\n\n\n                        \n                        California wildfires “are a deliberate criminal land grab in preparation for Agenda 2030 and smart cities.”\n                        \n                      \n\n\n\n\n\n\n\n\n\n\n\n                    By Maria Briceño • January 9, 2025\n                  \n\n\n\n\n\n\n\n\n        Load more\n      \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                Offices\n              \n\n\n\nDistrict of Columbia\n\n\n\n                    1800 I Street NW\n                  \nWashington, DC\n20006\n\n\n\nFlorida\n\n\n                    801 3rd St. S\n                  \nSt. Petersburg, FL\n33701\n727-821-9494\n\n\n\n\n\n\n\n                People\n              \n\n\n\n\n                      Joe Biden\n                    \n\n\n\n                      Kamala Harris\n                    \n\n\n\n                      Donald Trump\n                    \n\n\n\n                      Mitch McConnell\n                    \n\n\n\n                      Hakeem Jeffries\n                    \n\n\n\n                      Ron DeSantis\n                    \n\n\n\n\n\n\n\n\n                State Editions\n              \n\n\nCalifornia\nFlorida\nIowa\nMichigan\nNew Hampshire\nNew York\nNorth Carolina\nPennsylvania\nTexas\nWest Virginia\nWisconsin\n\n\n\n\n\n\n\n                About Us\n              \n\n\n\n\n                      Our Process\n                    \n\n\n\n                      Our Staff\n                    \n\n\n\n                      En Español\n                    \n\n\n\n                      Who pays for PolitiFact?\n                    \n\n\n\n                      Advertise with Us\n                    \n\n\n\n                      Corrections and Updates\n                    \n\n\n\n\n                        Newsletters\n                      \n\n\n\n\n\n\n\n                RSS Feeds\n              \n\n\n\n\n                      Recent Articles and Fact-checks\n                    \n\n\n\n                      Recent Fact-checks\n                    \n\n\n\n\n\n\n\n                  Suggest a Fact-check\n                \n\n\n\n\n\n\n\n\n\n              Follow us\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n              The Facts Newsletter\n            \n\n\n\n\n\n\n\n              Sign up\n            \n\n\n\n\n\n\n\nTerms & Conditions\n\n\nPrivacy Policy\n\n\nCopyright\n\n\n            ©All Rights Reserved Poynter Institute 2020, a 501(c)(3) nonprofit organization\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
            "metadata": {
                "source": "https://www.politifact.com/article/2024/may/02/fact-checking-trumps-claims-about-tax-cuts-job-num/"
            }
        },
        {
            "page_content": "The Rose Garden celebrations of Trump (and some tax thing), ranked - The Washington Post\nAccessibility statementSkip to main contentDemocracy Dies in DarknessclockThis article was published more than 7 years agoDemocracy Dies in DarknessPoliticsBiden administrationDonald TrumpThe FixThe BriefsPollingDemocracy in AmericaElectionsPoliticsBiden administrationDonald TrumpThe FixThe BriefsPollingDemocracy in AmericaElectionsThe Rose Garden celebrations of Trump (and some tax thing), rankedDecember 20, 2017President Trump on Dec. 20 said that the GOP tax bill that passed the House and Senate is the “largest tax cut in the history of our country.” (Video: Reuters)Analysis by  Philip BumpAfter the House and the Senate voted to approve the sweeping tax-reform package championed by President Trump — and, then, after the House voted to approve it again on Wednesday after some technicalities were worked out — Republican leaders held a celebration at the White House in recognition of their achievement.Myriad speakers offered their praise, using words such as “honor” and “commitment” and “history.” Some even used words of praise for something besides President Trump.Trump was the primary focus of the accolades offered by members of Congress and his own vice president. By our count, about 2,000 words of praise were offered to Congress, to the bill itself and to the president. Trump was the focus of more than half of what was said.It was a big day for venerating Trump, with Vice President Pence slathering the president with praise during a Cabinet meeting a few hours earlier. But at the event to celebrate the tax bill — a bill that in its final form was noticeably different from what Trump had promised on the campaign trail — the focus remained on the role Trump had played in shepherding the process. Or, more broadly, in just generally being great.AdvertisementWe decided to determine who actually devoted the largest chunk of their remarks to Trump as opposed to the bill or to their Capitol Hill peers. This is subjective, but we’ve included  snippets of their speeches that were used in our analysis below, for you to judge the merits. (These are presented in complete chunks but without unrelated filler text. Some quotes praising multiple parties are included in multiple categories.)For all of Pence’s enthusiasm at the Cabinet meeting, he was only in the middle of the pack on the South Lawn — at least in terms of the percentage of words of praise that he lavished on his boss. In raw word count, no one said more nice things about Trump than Pence. But as a function of all the praise offered? A surprise winner, whom we will not spoil early.Except in this diagram ranking the speeches from lowest percentage to highest percentage of praise for Trump. The full ranking follows.11. House Speaker Paul D. Ryan (R-Wis.)Praise for the bill: 131 wordsAdvertisement“The message to the families in America who have been struggling paycheck and paycheck — your tax rates are going down and your paychecks are going up. This is the kind of relief that Americans deserve. This is the kind of tax reform and tax cuts that get our economy growing to reach its potential. This gets us better wages, bigger paychecks, a simpler tax system. This gets the American economy competitive in the global economy.”“This is one of the most important things we could do for all of the people we represent. This is generational, and we’re so excited that we are going to launch, next year, this fantastic tax reform so that the American people can see how we can truly reach our economic growth and our economic potential.”Praise for Congress: 63 words“I want to thank my partner, Mitch McConnell, over in the Senate, for getting us to where we are. And I want to thank these two chairmen, Orrin Hatch and Kevin Brady. Thank you so much for your leadership on this.”Advertisement“And if it weren’t for all the leadership of the men and women up here, this would not have been made possible.”Praise for Trump: 37 words“Something this big, something this generational, something this profound, could not have been done without exquisite presidential leadership. Mr. President, thank you for getting us over the finish line. Thank you for getting us where we are.”10. Sen. Lisa Murkowski (R-Alaska)Praise for the bill: 37 words“But, with passage of this tax bill, with passage finally, almost 40 years later, to allow us to open up the 1002 area, this is a bright day for Alaska. This is a bright day for America.”Praise for Congress: 0 wordsPraise for Trump: 10 words“We thank you for that. We thank you for that.”9. Sen. Tim Scott (R-S.C.)Praise for the bill: 131 words“As a part of this tax reform package, the Investing in Opportunity Act has been included, which will bring trillions of dollars into poor communities.”Advertisement“This tax reform plan delivers, for the average single mother, a 70 percent tax cut.”“For the average family who’s working paycheck to paycheck, looking for ways to be hopeful about their future, to have an extra night for dinner out at a restaurant, this tax-reform package cuts their taxes by nearly 60 percent.”“Because of folks like Marco Rubio and Ivanka, when you think about the folks with kids in the household, this plan doubles the Child Tax Credit and makes about 70 percent of it refundable. This is a plan that we can be proud of, because it speaks to the hearts of everyday Americans.”Praise for Congress: 0 wordsPraise for Trump: 46 words“We talked about legislation that can move those communities forward. And you said, ‘Yes.’ And, as a part of this tax-reform package, the Investing in Opportunity Act has been included, which will bring trillions of dollars into poor communities, because of your willingness to listen.”8. Rep. Don Young (R-Alaska)Praise for the bill: 16 wordsAdvertisement“This bill does what’s right for this nation, and the great land will be great again.”Praise for Congress: 36 words“I want to thank all these guys standing behind me, these ladies, the people that helped me do this.”“I want to thank the president — I want to thank you, Mr. President — and my two senators.”Praise for Trump: 25 words“Thank you, Mr. President.”“I want to thank the president — I want to thank you, Mr. President — and my two senators.”“Thank you, Mr. President.”7. Rep. Diane Black (R-Tenn.)Praise for the bill: 29 words“We are giving them a huge gift for Christmas: a break in these taxes and an opportunity for our jobs to grow and to give them a bigger paycheck.”Praise for Congress: 97 words“I want to thank all of the folks that are standing behind me, because it has been a team effort.”Advertisement“I want to thank Kevin Brady, who I know — hours and hours and hours — worked hard to make this happen in what was really a short period of time.”“Some of the folks that are being left out right now — and I know we’ve thanked them before, but I want to thank them publicly. And that is all of the staff that has worked so hard in both the House and the Senate to make this happen.”Praise for Trump: 66 words“Thank you, Mr. President.”“It is such an honor to stand here with the president of the United States, the vice president of the United States, who have been an integral part in making sure that this happened.”“I want to say thank you to Mr. President — thank you, President Trump, for allowing us to have you as our president and to make America great again.”6. Rep. Kevin Brady (R-Tex.)Praise for the bill: 115 wordsAdvertisement“There are three dates you need to put on your calendar. The first is New Year’s Day, because, on New Year’s, our country will have a new tax code for a new era of American prosperity — New Year’s Day. In February, look to your paychecks. Hard-working Americans will see the result of the hard work of this president and this Congress to make this tax reform possible. It will show in your paychecks. And then, April 15th — that hated day — this April 15th will be the last time you ever file your taxes under this horrible, broken tax code, because you’ll have a new one for the future of your family and your small business.”Praise for Congress: 33 words“Remarkable leadership and courage from the men and women behind me in the Senate, and especially my colleagues in the House — when you put together remarkable leadership in the House and the Senate…”AdvertisementPraise for Trump: 113 words“Thank you, Mr. President.”“People often ask, ‘When did you know? When did you know tax reform could be achieved in America for the first time in 31 years?’ And my answer is always the same: November 8th, when President Trump — you were elected president of the United States. That’s when I knew it was real.”“Mr. President — your willingness to make this your commitment to go across the country to sell the need for tax reform and then stay at the table with us and on the phone with us to get this done — but for your leadership, we would not be here today. Thank you so much.”“Thank you, Mr. President.”5. Vice President PencePraise for the bill: 82 words“…the largest tax cut in American history before Christmas of this year.”“The president laid out his vision for a tax cut that would be a middle-class miracle, and that’s exactly what the Congress passed today.”“This tax cut will put more money in the pockets of the American people. It will make our tax code more simple, more fair, more easy to understand. It’ll make businesses across America more competitive to create good-paying jobs and raise wages for working Americans.”Praise for Congress: 61 words“To members of our Cabinet, to Leader McConnell, to Speaker Ryan, all these members of Congress, thank you. Thank you not only for being here today for this special moment, but thank you for your leadership and support throughout this year.”“With the strong support of these members of Congress, President Donald Trump delivered a great victory for the American people.”Praise for Trump: 401 words“More importantly, thank you for your leadership. Thank you for your boundless faith in the American people, and thank you for keeping your promise to see this Congress deliver the largest tax cut in American history before Christmas of this year.”“I truly do believe, Mr. President, that this will be remembered as a pivotal moment in the life of our nation, a day when the Congress answered your call and made history.”“But honestly, I would say to the American people, President Trump has been making history since the first day of this administration.”“Just last week, President Trump signed one of largest investments in our national defense since the days of Ronald Reagan.”“President Trump has been restoring American credibility on the world stage, standing with our allies and standing up to our enemies.”“This president’s put Iran on notice and put the war in Afghanistan on a path to victory.”“Thanks to the leadership of this commander in chief and the courage of our armed forces, ISIS on the run, their capital has fallen and their so-called caliphate has crumbled across Syria and Iraq.”“President Trump also knows that American strength starts with a growing American economy. And, from the first day of this administration, this president championed free and fair trade.”“He rolled back federal red tape at record levels.”“Today, Mr. President, you’ve fulfilled the promise you made to millions of Americans struggling in this economy, to cut taxes across the board for working families and businesses large and small.”“In August of this year, the president laid out his vision for a tax cut that would be a middle-class miracle, and that’s exactly what the Congress passed today.”“President Donald Trump is a man of his word. He’s a man of action. And with the strong support of these members of Congress, President Donald Trump delivered a great victory for the American people.”“I can assure you this president and this entire administration will not rest and relent until the forgotten men and women of America are forgotten no more.”“Thank you, Mr. President. Thank you for your leadership. Thank you for your love for this country and the people of this country. And I know in my heart, with the strong, continued support of the members of Congress who are gathered on these steps and with God’s help, you will make America great again.”4. Sen. Dan Sullivan (R-Alaska)Praise for the bill: 14 words“You talk about the economy, which is what this tax bill is all about…”Praise for Congress: 0 wordsPraise for Trump: 41 words“I want to thank you and your administration.”“I want to thank you. I want to thank you on behalf of all Alaskans and the American people, because it’s the right policy and we’re finally, finally doing it. Thank you, sir.”3. Sen. Orrin G. Hatch (R-Utah)Praise for the bill: 0 wordsPraise for Congress: 33 words“[This bill] couldn’t have passed without the Alaskan delegation, couldn’t have passed without the leadership in the House and the Senate, Paul Ryan and Mitch McConnell and the other leaders as well.”“…these wonderful colleagues…”Praise for Trump: 140 words“Mr. President, I have to say that you’re living up to every — everything I thought you would. You’re one heck of a leader and we’re all benefiting from it. This bill could not have passed without you…”“You stop and think about it, this president hasn’t even been in office for a year, and look at all the things that he’s been able to get done, by sheer will in many ways.”“I just hope that we all get behind him every way we can.”“I have to say that this is one of the great privileges of my life, to stand here on the White House lawn with the president of the United States, who I love and appreciate so much…”“We’re going to make this the greatest presidency that we’ve seen not only in generations, but maybe ever.”2. Senate Majority Leader Mitch McConnell (R-Ky.)Praise for the bill: 0 wordsPraise for Congress: 11 words“We’ve cemented the Supreme Court right of center for a generation.”Praise for Trump: 97 words“Well, let me just say, Mr. President, you made the case for the tax bill, but this has been a year of extraordinary accomplishment for the Trump administration.”“Mr. President, thanks to your nominees, we put 12 circuit court judges in place, the most since the circuit court system was established in 1891. You hold the record.”“You’ve ended the overregulation of the American economy, and that, coupled with what we did last night and what the House finished this morning, means America is going to start growing again.”“Thank you, Mr. President, for all you’re doing.”1. House Majority Leader Kevin McCarthy (R-Calif.)Praise for the bill: 5 words“Come February, check your check.”Praise for Congress: 0 wordsPraise for Trump: 123 words“To the president and vice president, during that campaign, you listened to voices no one else was listening to. You listened to those that were trying to get a pay raise, or that parent that was fighting for their children, or to that person who always dreamed of being an entrepreneur, creating a small business like you did, Mr. President. And, you know what? For all those people, you heard them. We would not be standing here today if it wasn’t for you. Doesn’t matter if you were overseas fighting for America; so many people back here got your phone call fighting for tax reform.”“Come February, check your check, because that will be the pay raise of the vote for Donald Trump.”Sign upCompanyAbout The Post Newsroom Policies & Standards Diversity & Inclusion Careers Media & Community Relations WP Creative Group Accessibility Statement SectionsTrending Politics Elections Opinions National World Style Sports Business Climate Well+Being D.C., Md., & Va. Obituaries Weather Arts & Entertainments Recipes Get The PostManage Your Subscription Become a Subscriber Gift Subscriptions Mobile & Apps Newsletters & Alerts Washington Post Live Reprints & Permissions Post Store Books & E-Books Print Special Editions Store Print Archives (Subscribers Only) Today’s Paper Public Notices Contact UsContact the Newsroom Contact Customer Care Contact the Opinions Team Advertise Licensing & Syndication Request a Correction Send a News Tip Report a Vulnerability Terms of UseDigital Products Terms of Sale Print Products Terms of Sale Terms of Service Privacy Policy Cookie Settings Submissions & Discussion Policy RSS Terms of Service Sitemap Ad Choices Your Privacy Choices washingtonpost.com  © 1996-2025 The Washington PostCompanyChevron IconDiversity & Inclusion Careers Media & Community Relations WP Creative Group Accessibility Statement SectionsChevron IconTrending Politics Elections Opinions National World Style Sports Business Climate Well+Being D.C., Md., & Va. Obituaries Weather Arts & Entertainments Recipes Get The PostChevron IconManage Your Subscription Become a Subscriber Gift Subscriptions Mobile & Apps Newsletters & Alerts Washington Post Live Reprints & Permissions Post Store Books & E-Books Print Special Editions Store Print Archives (Subscribers Only) Today’s Paper Public Notices Contact UsChevron IconContact the Newsroom Contact Customer Care Contact the Opinions Team Advertise Licensing & Syndication Request a Correction Send a News Tip Report a Vulnerability Download the Washington Post App About The Post Policies & Standards Digital Products Terms of Sale Print Products Terms of Sale Terms of Service Privacy Policy Cookie Settings Submissions & Discussion Policy RSS Terms of Service Sitemap Ad Choices Your Privacy Choices washingtonpost.com © 1996-2025 The Washington Post\n\n",
            "metadata": {
                "source": "https://www.washingtonpost.com/news/politics/wp/2017/12/20/the-rose-garden-celebrations-of-trump-and-some-tax-thing-ranked/"
            }
        },
        {
            "page_content": "\n\n\n\n\n\n\nPolitiFact | Did Donald Trump propose the biggest tax hike in American history as Jeb Bush says?\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                  The Poynter Institute\n                \n\n\n\n\n\n\n\nMenu\n\n\n\n\n            Donate\n          \n\n\n\n\n\n\n\n\n\n\n                    State Editions\n                  \n\n\n\n\n                          California\n                        \n\n\n\n                          Florida\n                        \n\n\n\n                          Iowa\n                        \n\n\n\n                          Michigan\n                        \n\n\n\n                          New Hampshire\n                        \n\n\n\n                          New York\n                        \n\n\n\n                          North Carolina\n                        \n\n\n\n                          Pennsylvania\n                        \n\n\n\n                          Texas\n                        \n\n\n\n                          West Virginia\n                        \n\n\n\n                          Wisconsin\n                        \n\n\n\n\n\n\n\n\n\n\n                    Issues\n                  \n\n\n\nAll Issues\n\n\n\n                          Online hoaxes\n                        \n\n\n\n                          Coronavirus\n                        \n\n\n\n                          Health Care\n                        \n\n\n\n                          Immigration\n                        \n\n\n\n                          Extremism\n                        \n\n\n\n                          Taxes\n                        \n\n\n\n                          Marijuana\n                        \n\n\n\n                          Environment\n                        \n\n\n\n                          Crime\n                        \n\n\n\n                          Guns\n                        \n\n\n\n                          Foreign Policy\n                        \n\n\n\n                          LGBTQ+\n                        \n\n\n\n\n\n\n\n\n\n                    People\n                  \n\n\n\n\n                          Joe Biden\n                        \n\n\n\n                          Kamala Harris\n                        \n\n\n\n                          Donald Trump\n                        \n\n\n\n                          Mitch McConnell\n                        \n\n\n\n                          Hakeem Jeffries\n                        \n\n\n\n                          Ron DeSantis\n                        \n\n\n\n\n\n\n\n\n\n                    Media\n                  \n\n\n\n\n                          PunditFact\n                        \n\n\n\n                          Tucker Carlson\n                        \n\n\n\n                          Sean Hannity\n                        \n\n\n\n                          Rachel Maddow\n                        \n\n\n\n                          Bloggers\n                        \n\n\n\n                          PolitiFact Videos\n                        \n\n\n\n\n\n\n\n                    Campaigns\n                  \n\n\n\n\n                          2024 Elections\n                        \n\n\n\n\n\n\n\n\n\n                    Truth-o-Meter\n                  \n\n\n\n\n                          True\n                        \n\n\n\n                          Mostly True\n                        \n\n\n\n                          Half True\n                        \n\n\n\n                          Mostly False\n                        \n\n\n\n                          False\n                        \n\n\n\n                          Pants on Fire\n                        \n\n\n\n\n\n\n\n                    Promises\n                  \n\n\n\n\n                          Biden Promise Tracker\n                        \n\n\n\n                          Trump-O-Meter\n                        \n\n\n\n                          Obameter\n                        \n\n\n                          Latest Promises\n                        \n\n\n\n\n\n\n\n\n\n\n                    About Us\n                  \n\n\n\n\n                          Our Process\n                        \n\n\n\n                          Our Staff\n                        \n\n\n\n                          En Español\n                        \n\n\n\n                          Who pays for PolitiFact?\n                        \n\n\n\n                          Advertise with Us\n                        \n\n\n\n                          Suggest a Fact-check\n                        \n\n\n\n                          Corrections and Updates\n                        \n\n\n\n                          Newsletters\n                        \n\n\n\n\n\n\n\n\n\n\n\n              Donate\n            \n\n\n\n\n                Follow us\n              \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                The Facts Newsletter\n              \n\n\n\n\n\n\n                Sign up\n              \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEnglish\n\nEspañol\n\n\n\n\n\n\n\n\n\n\n\n\n          Stand up for the facts!\n        \n\n        Our only agenda is to publish the truth so you can be an informed participant in democracy.\n        We need your help.\n        \n\nMore Info\n\n\n\n\n\n\n          I would like to contribute\n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOne Time\nMonthly\nYearly\n\n\n\n\n\n\n            Join Now\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n            Jeb Bush\n          \n\n            stated on August 21, 2015 in a fundraising email:\n          \n\n\n\n\n\n\n              \n              \"Trump proposed enacting the largest tax increase in American history.\"\n \n\n              \n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCandidate Biography\n\n\n\n\nTaxes\n\n\n\n\nFlorida\n\n\n\n\n\n\n\nJeb Bush\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n        Donald Trump was on the cover of the New York Daily News for his tax hike proposal on Nov. 10, 1999.(ABC News/New York Daily News)\n        \n      \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n    \n    By Amy Sherman\nSeptember 2, 2015\n\n\n\n\n\n\n        \n        Did Donald Trump propose the biggest tax hike in American history as Jeb Bush says?\n        \n      \n\n\n\nRepublican candidates continue to attack Donald Trump on his past positions, claiming he is not the conservative he says he is today.\nJeb Bush picked up the attack by taking on Trump over tax policy. \n\"I cut taxes every year,\" Bush said at an Aug. 20 rally in New Hampshire. \"He’s proposed the largest tax increase in mankind’s history, not just our own country’s history.\"\nThe next day Bush repeated the basic claim in a fundraising email: \"Trump proposed enacting the largest tax increase in American history.\"\nSeems like something worth fact-checking.\n\n\n\nSign up for PolitiFact texts\n\n\n\n\n\n\nTrump’s tax plan in 1999\nA spokesman for Bush told us that the former Florida governor was referring to Trump’s 1999 proposal to raise taxes on the rich.\nTrump, who at the time was considering a run for president under the Reform Party, proposed a one-time tax on individuals and trusts with a worth of $10 million or more. Trump said the one-time tax of 14.25 percent would raise $5.7 trillion and wipe out the debt. Trump said if the rich were having trouble liquidating their assets they could pay off their tax over 10 years.\nThe New York Daily News featured a photograph of Trump with the words, \"SOAK THE RICH.\"\nExperts at the time bashed Trump’s plan as economically and politically unviable.\n\"I don't think the plan makes much economic sense,\" said Stephen Moore, director of fiscal policy studies at the libertarian Cato Institute told the New York Times in 1999. \"The fact is that most people's wealth that has been built up over 10, 20 or 50 years is wealth that has already been taxed.\"\nDaniel Mitchell, a senior fellow at the Heritage Foundation in 1999 said of Trump’s plan at the time, \"The lunacy of this idea is almost indescribable.\" He raised concerns about the economic consequences including that households would shift assets overseas to try to avoid confiscation.\nTrump calculated that 1 percent of Americans would pay the Trump tax. He proposed that half the savings would go toward middle-class tax cuts and the other half for Social Security.\nA spokeswoman for Trump’s 2016 presidential campaign, Hope Hicks, wouldn’t tell us if Trump still supports that plan and said that he will release his current tax plan later in September.\nBut in 2011, talk show host George Stephanopoulos asked Trump if he still supported that tax, and Trump said it was no longer viable.\n\"Well, at a time, it would have paid off the deficit. I mean, you wouldn't have a deficit, at that time,\" Trump said (though he confused debt and deficit). \"Unfortunately, the world has changed, today you can't do it. Today, and I'm very strongly against tax increases. And the reason I'm-\"\n\"So, you're no longer for that tax?\" Stephanopoulos asked.\n\"No, no. I'm no longer for that tax, no,\" Trump said.\nWould Trump’s tax have broken records? \nMany tax experts told us that indeed Trump’s plan would have been record-breaking in terms of revenue, but they said it was never going to happen and lacked major details.\n\n\n      Featured Fact-check\n    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n            Charlie Crist\n          \n\n            stated on March 28, 2010 in a FOX News Sunday debate.\n          \n\n\n\n\n\n\n\n                \n                Rubio's tax swap proposal \"would have been a massive tax increase.\"\n                \n              \n\n\n\n\n\n\n\n\n\n\n\n            By Aaron Sharockman • March 28, 2010\n          \n\n\n\n\n\n\n\"It certainly would have been the biggest ever simply because of its sheer size -- it was trillions of dollars,\" said Roberton Williams, a fellow at the Tax Policy Center. However, \"it’s a totally crazy idea. ...  I don't think anybody was taking it seriously -- it was Donald Trump being Donald Trump.\"\nThe United States’ gross domestic product in 1999 was $9.7 trillion, so if Trump’s tax had raised $5.7 trillion, that would have been 59 percent of GDP, said Chris Edwards of the libertarian Cato Institute.\nFederal tax hikes typically are no more than 1 percent of GDP, Edwards said.\n\"The Bush 1990 hike and Clinton 1993 hike were less than 1 percent of GDP over 5 years —  whereas Trump’s tax would have been 59 percent one time in one year,\" Edwards said.\nPolitiFact previously has looked into the largest tax increases as a percentage of GDP. Topping the list from 1940-2006 was the Revenue Act of 1942, which was about 5 percent of GDP.\nRichard Phillips, an expert at the Citizens for Tax Justice research group, which aims to require the wealthy to pay their fair share, said that Trump’s one-time tax proposal can’t be compared to conventional tax reform, which typically refers to taxes collected annually.\n\"His estimate was based on a back of the envelope calculation of total wealth of individuals with over $10 million in assets multiplied by the 14.25 percent rate,\" he said. \"There are very real questions as to whether you could plausibly tax all forms of wealth and whether wealthy individuals would be able to take action to shield large swaths of their wealth from taxation.\"\nAdditionally, Trump proposed repealing the estate tax and enacting other tax cuts using the revenue that the federal government would save by no longer paying interest on the national debt. It’s not clear how much those tax cuts would have cost and how much of the tax they would offset over time, Phillips said.\nOur ruling\nBush said, \"Trump proposed enacting the largest tax increase in American history.\"\nYes, in 1999, Trump proposed a historically large one-time tax increase. Trump said the tax would have raised $5.7 trillion and wiped out the national debt. It would have applied only to the wealthiest Americans.\nThis claim rates True.\n\n\n\n\n\n\n        \n        Read About Our Process\n        \n      \n\n\n\n\n\n\n\n\n            \n            The Principles of the Truth-O-Meter\n            \n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOur Sources\n\n\nTampa Bay Times The Buzz blog, \"Jeb Bush tries to undercut Donald Trump in Alabama,\" Aug. 21, 2015\nOffice of Tax Analysis Department of the U.S. Treasury, \"Revenue Effects of Major Tax Bills Updated Tables for all 2010 Bills,\" June 2011\nCato Institute, \"Social policy, supply side and fundamental reform: Republican tax policy 1999-2004,\" Nov. 1, 2004\nTax Justice blog, \"Donald Trump’s regressive and retrograde tax plan,\" June 22, 2015\nCNN, \"Trump proposes massive one-time tax on the rich,\" Nov. 9, 1999\nAssociated Press, \"Trump would soak the rich, including himself, as president,\" (Accessed in Nexis) Nov. 9, 1999\nNew York Times, \"Trump proposes clearing nation’s debt at expensive of rich including himself,\" (Accessed in Nexis) Nov. 10, 1999\nWashington Times, \"Going for the bold on taxation,\" (Accessed in Nexis) Nov. 17, 1999\nABC News, \"Donald Trump once proposed the biggest tax hike ever,\" Aug. 6, 2015\nABC News, Transcript of ABC This Week, Aug. 9, 2015\nBuzzfeed, \"Donald Trump In 1999: \"I Believe In Universal Health Care…It’s An Entitlement\" From Birth,\" July 29, 2015\nPolitiFact, \"Donald Trump says U.S. is most highly taxed nation in the world,\" Aug. 28, 2015\nPolitiFact, \"Bush says Trump a Democrat longer than a Republican ‘in the last decade,’\" Aug. 24, 2015\nPolitiFact, \"Is Donald Trump still for ‘single-payer’ health care?\" Aug. 2, 2015\nPolitiFact, \"Fiorina: Trump’s abortion flip flop,\" Aug. 11, 2015\nInterview with Roberton Williams, senior fellow at the Tax Policy Center, Sept. 1, 2015\nInterview with Chris Edwards, director of tax policy at the Cato Institute, Sept. 1, 2015\nInterview, Steve Ellis, vice president of Taxpayers for Common Sense, Sept. 1, 2015\nInterview, Richard Phillips, research analyst at Citizens for Tax Justice, Aug. 24, 2015\ninterview, Matt Gorman, Jeb Bush campaign spokesman, Aug. 25, 2015\nInterview, Allie Brandenburger, Jeb Bush campaign spokeswoman, Aug. 31, 2015\nInterview, Hope Hicks, Donald Trump campaign spokeswoman, Sept. 1, 2015\n \n\n\n\n\n\n\n\n\n\n\n\n          Browse the Truth-O-Meter\n        \n\n          \n          More by Amy Sherman\n          \n        \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                      Bernie Sanders\n                    \n\n                      stated on January 2, 2025 in a statement to the media:\n                    \n\n\n\n\n\n\n\n                          \n                          H-1B guest workers are “being employed as dog trainers, massage therapists, cooks, and English teachers.”\n                          \n                        \n\n\n\n\n\n\n\n\n\n\n\n                      By Amy Sherman • January 9, 2025\n                    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                      Donald Trump\n                    \n\n                      stated on January 7, 2025 in a press conference:\n                    \n\n\n\n\n\n\n\n                          \n                          “They’re still counting the (2024 election) vote in some areas.”\n                          \n                        \n\n\n\n\n\n\n\n\n\n\n\n                      By Amy Sherman • January 7, 2025\n                    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                      Sara Jacobs\n                    \n\n                      stated on December 18, 2024 in an X post:\n                    \n\n\n\n\n\n\n\n                          \n                          Government shutdowns in 2013 and 2018 “cost our economy billions of dollars each.”\n                          \n                        \n\n\n\n\n\n\n\n\n\n\n\n                      By Louis Jacobson • December 19, 2024\n                    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Facebook posts\n                    \n\n                      stated on November 1, 2024 in a post:\n                    \n\n\n\n\n\n\n\n                          \n                          Gwinnett County, Georgia, sheriff's office said white supremacists “are planning to attack” Black people “from now until the Inauguration.”\n                          \n                        \n\n\n\n\n\n\n\n\n\n\n\n                      By Amy Sherman • November 5, 2024\n                    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       X posts\n                    \n\n                      stated on November 1, 2024 in a post:\n                    \n\n\n\n\n\n\n\n                          \n                          Video shows the FBI reported that “three linked groups have been apprehended for rigging early voting by mail-in ballot.”\n                          \n                        \n\n\n\n\n\n\n\n\n\n\n\n                      By Amy Sherman • November 3, 2024\n                    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Patriot Voice\n                    \n\n                      stated on October 30, 2024 in an article on a website:\n                    \n\n\n\n\n\n\n\n                          \n                          Vice President Kamala Harris and husband Doug Emhoff received $500,000 for tipping off Sean “Diddy” Combs about police raids.\n                          \n                        \n\n\n\n\n\n\n\n\n\n\n\n                      By Amy Sherman • November 2, 2024\n                    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                      Donald Trump\n                    \n\n                      stated on October 29, 2024 in a rally in Allentown, Pa.:\n                    \n\n\n\n\n\n\n\n                          \n                          In Lancaster, Pa., “We caught them with 2,600 votes. We caught them cold, 2,600 votes. ... And every vote was written by the same person.\"\n                          \n                        \n\n\n\n\n\n\n\n\n\n\n\n                      By Amy Sherman • October 30, 2024\n                    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                      Donald Trump\n                    \n\n                      stated on October 23, 2024 in a post on X:\n                    \n\n\n\n\n\n\n\n                          \n                          Vice President Kamala Harris has been “going so far as to call me Adolf Hitler.”\n                          \n                        \n\n\n\n\n\n\n\n\n\n\n\n                      By Samantha Putterman • October 24, 2024\n                    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                      JD Vance\n                    \n\n                      stated on October 16, 2024 in a campaign event:\n                    \n\n\n\n\n\n\n\n                          \n                          Says former President Donald Trump did not lose the 2020 election.\n                          \n                        \n\n\n\n\n\n\n\n\n\n\n\n                      By Amy Sherman • October 17, 2024\n                    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       Instagram posts\n                    \n\n                      stated on October 7, 2024 in una publicación en Instagram:\n                    \n\n\n\n\n\n\n\n                          \n                          La administración de Joe Biden tomó dinero de ayudas de FEMA para usarlo en inmigrantes.\n                          \n                        \n\n\n\n\n\n\n\n\n\n\n\n                      By Maria Briceño • October 16, 2024\n                    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                      Donald Trump\n                    \n\n                      stated on October 11, 2024 in a Truth Social post:\n                    \n\n\n\n\n\n\n\n                          \n                          “It has just come out that Democrats in Washington and the Democrat Governor’s Office of North Carolina (Roy Cooper) were blocking people and money from coming into North Carolina.”\n                          \n                        \n\n\n\n\n\n\n\n\n\n\n\n                      By Amy Sherman • October 12, 2024\n                    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                       X posts\n                    \n\n                      stated on October 9, 2024 in social media posts:\n                    \n\n\n\n\n\n\n\n                          \n                          North Carolina’s new voting rules in response to Hurricane Helene amount to “cheating” or “stealing.”\n                          \n                        \n\n\n\n\n\n\n\n\n\n\n\n                      By Amy Sherman • October 11, 2024\n                    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                      Robert Reich\n                    \n\n                      stated on October 8, 2024 in an Instagram post:\n                    \n\n\n\n\n\n\n\n                          \n                          “Two weeks ago 100 GOP lawmakers voted against additional FEMA funding.”\n                          \n                        \n\n\n\n\n\n\n\n\n\n\n\n                      By Amy Sherman • October 11, 2024\n                    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                      Donald Trump\n                    \n\n                      stated on October 7, 2024 in an interview with Hugh Hewitt:\n                    \n\n\n\n\n\n\n\n                          \n                          Of Gaza, “I’ve been there.”\n                          \n                        \n\n\n\n\n\n\n\n\n\n\n\n                      By Amy Sherman • October 8, 2024\n                    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                      Donald Trump\n                    \n\n                      stated on October 4, 2024 in a conversation with reporters:\n                    \n\n\n\n\n\n\n\n                          \n                          The Biden administration stole $1 billion “from FEMA to use it for illegal migrants. … And FEMA is now busted. They don’t have any money.”\n                          \n                        \n\n\n\n\n\n\n\n\n\n\n\n                      By Maria Ramirez Uribe • October 8, 2024\n                    \n\n\n\n\n\n\n\n\n\n\n\n\nDid Donald Trump propose the biggest tax hike in American history as Jeb Bush says?\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                    Threads posts\n                  \n\n                    stated on January 8, 2025 in a post on Threads:\n                  \n\n\n\n\n\n\n\n                        \n                        “Blue items that survive” California wildfires are “indicative of DEW's (Directed Energy Weapons).”\n                        \n                      \n\n\n\n\n\n\n\n\n\n\n\n                    By Madison Czopek • January 10, 2025\n                  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                     Facebook posts\n                  \n\n                    stated on January 8, 2025 in una publicación en Facebook:\n                  \n\n\n\n\n\n\n\n                        \n                        Imagen muestra el letrero de Hollywood en California en llamas el 8 de enero de 2025.\n                        \n                      \n\n\n\n\n\n\n\n\n\n\n\n                    By Maria Briceño • January 10, 2025\n                  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                     Facebook posts\n                  \n\n                    stated on January 9, 2025 in a Facebook post:\n                  \n\n\n\n\n\n\n\n                        \n                        Video shows a man saving a bunny during the 2025 Los Angeles fires.\n                        \n                      \n\n\n\n\n\n\n\n\n\n\n\n                    By Loreben Tuquero • January 10, 2025\n                  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                    Social Media\n                  \n\n                    stated on January 8, 2025 in social media posts:\n                  \n\n\n\n\n\n\n\n                        \n                        Image shows the Hollywood sign was on fire as of Jan. 8.\n                        \n                      \n\n\n\n\n\n\n\n\n\n\n\n                    By Loreben Tuquero • January 10, 2025\n                  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                     Viral image\n                  \n\n                    stated on January 5, 2025 in a Facebook post:\n                  \n\n\n\n\n\n\n\n                        \n                        Video shows Dr. Mehmet Oz and rapper Snoop Dogg promoting treatment for chronic lung diseases.”\n                        \n                      \n\n\n\n\n\n\n\n\n\n\n\n                    By Ciara O'Rourke • January 10, 2025\n                  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                     X posts\n                  \n\n                    stated on January 7, 2025 in an X post:\n                  \n\n\n\n\n\n\n\n                        \n                        Video shows directed energy weapons starting fires in California.\n                        \n                      \n\n\n\n\n\n\n\n\n\n\n\n                    By Ciara O'Rourke • January 10, 2025\n                  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                     Viral image\n                  \n\n                    stated on January 6, 2025 in a Facebook post:\n                  \n\n\n\n\n\n\n\n                        \n                        McQueen High School in Nevada issued a “masturbation notice” to students.\n                        \n                      \n\n\n\n\n\n\n\n\n\n\n\n                    By Ciara O'Rourke • January 10, 2025\n                  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                     Viral image\n                  \n\n                    stated on January 1, 2025 in a Facebook post:\n                  \n\n\n\n\n\n\n\n                        \n                        Actor Tom Hanks died in a “fatal car accident.”\n                        \n                      \n\n\n\n\n\n\n\n\n\n\n\n                    By Ciara O'Rourke • January 10, 2025\n                  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                     X posts\n                  \n\n                    stated on January 8, 2025 in a post:\n                  \n\n\n\n\n\n\n\n                        \n                        “FEMA spent billions on illegal immigrants and now has no money for California!”\n                        \n                      \n\n\n\n\n\n\n\n\n\n\n\n                    By Kwasi Gyamfi Asiedu • January 10, 2025\n                  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                    Threads posts\n                  \n\n                    stated on January 7, 2025 in A Threads post:\n                  \n\n\n\n\n\n\n\n                        \n                        California wildfires “are a deliberate criminal land grab in preparation for Agenda 2030 and smart cities.”\n                        \n                      \n\n\n\n\n\n\n\n\n\n\n\n                    By Maria Briceño • January 9, 2025\n                  \n\n\n\n\n\n\n\n\n        Load more\n      \n\n\n\n\n\n\n\n\n          Support independent fact-checking.\n          Become a member!\n        \n\n\n\n          \n          In a world of wild talk and fake news, help us stand up for the facts.\n          \n        \n\n\n            Sign me up\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                Offices\n              \n\n\n\nDistrict of Columbia\n\n\n\n                    1800 I Street NW\n                  \nWashington, DC\n20006\n\n\n\nFlorida\n\n\n                    801 3rd St. S\n                  \nSt. Petersburg, FL\n33701\n727-821-9494\n\n\n\n\n\n\n\n                People\n              \n\n\n\n\n                      Joe Biden\n                    \n\n\n\n                      Kamala Harris\n                    \n\n\n\n                      Donald Trump\n                    \n\n\n\n                      Mitch McConnell\n                    \n\n\n\n                      Hakeem Jeffries\n                    \n\n\n\n                      Ron DeSantis\n                    \n\n\n\n\n\n\n\n\n                State Editions\n              \n\n\nCalifornia\nFlorida\nIowa\nMichigan\nNew Hampshire\nNew York\nNorth Carolina\nPennsylvania\nTexas\nWest Virginia\nWisconsin\n\n\n\n\n\n\n\n                About Us\n              \n\n\n\n\n                      Our Process\n                    \n\n\n\n                      Our Staff\n                    \n\n\n\n                      En Español\n                    \n\n\n\n                      Who pays for PolitiFact?\n                    \n\n\n\n                      Advertise with Us\n                    \n\n\n\n                      Corrections and Updates\n                    \n\n\n\n\n                        Newsletters\n                      \n\n\n\n\n\n\n\n                RSS Feeds\n              \n\n\n\n\n                      Recent Articles and Fact-checks\n                    \n\n\n\n                      Recent Fact-checks\n                    \n\n\n\n\n\n\n\n                  Suggest a Fact-check\n                \n\n\n\n\n\n\n\n\n\n              Follow us\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n              The Facts Newsletter\n            \n\n\n\n\n\n\n\n              Sign up\n            \n\n\n\n\n\n\n\nTerms & Conditions\n\n\nPrivacy Policy\n\n\nCopyright\n\n\n            ©All Rights Reserved Poynter Institute 2020, a 501(c)(3) nonprofit organization\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
            "metadata": {
                "source": "https://www.politifact.com/factchecks/2015/sep/02/jeb-bush/did-donald-trump-propose-biggest-tax-hike-history-/"
            }
        }
    ]
}